using Data;
using Data.Models;
using Data.Enums;
using Microsoft.AspNetCore.Identity;
using Microsoft.EntityFrameworkCore;

namespace SkillBox.App.Services
{
    public class DatabaseSeedService
    {
        private readonly SkillBoxDbContext dbContext;
        private readonly UserManager<SkillBoxUser> userManager;

        public DatabaseSeedService(SkillBoxDbContext dbContext,
            UserManager<SkillBoxUser> userManager)
        {
            this.dbContext = dbContext;
            this.userManager = userManager;
        }
        public async Task SeedAsync()
        {
            if (!await dbContext.Categories.AnyAsync())
            {
                Random rnd = new Random();
                string[] phoneNumbers = new string[50];
                for (int i = 0; i < phoneNumbers.Count(); i++)
                {
                    string rndNums = rnd.Next(0, 9).ToString();
                    for (int j = 0; j < 7; j++)
                    {
                        rndNums += rnd.Next(0, 9).ToString();
                    }
                    phoneNumbers[i] = "359" + rndNums;
                }

                City[] cities = new City[50];
                for (int i = 0; i < cities.Count(); i++)
                {
                    cities[i] = (City)rnd.Next(0, 227);
                }

                #region Ordinary users
                //Users
                var user1 = new SkillBoxUser
                {
                    UserName = "test123",
                    NormalizedUserName = "TEST123",
                    Email = "pesho@peshov.com",
                    NormalizedEmail = "PESHO@PESHOV.COM",
                    EmailConfirmed = true,
                    FirstName = "Димитър",
                    LastName = "Василев",
                    PhoneNumber = "359871234567",
                    PhoneNumberConfirmed = true,
                    Gender = Gender.Male,
                    City = City.Shumen,
                };
                await userManager.CreateAsync(user1, "123456");

                var user2 = new SkillBoxUser
                {
                    UserName = "emi43",
                    NormalizedUserName = "EMI43",
                    Email = "emi43@petrova.com",
                    NormalizedEmail = "EMI43@PETROVA.COM",
                    EmailConfirmed = true,
                    FirstName = "Emi",
                    LastName = "Petrova",
                    Gender = Gender.Female,
                    City = City.Varna,
                    WebsiteName = "NewHorizons"
                };
                await userManager.CreateAsync(user2, "123456");
                #endregion

                #region Categories
                //Categories
                var category1 = new Category()
                {
                    Name = "Храна"
                };
                await dbContext.Categories.AddAsync(category1);

                var categories2 = new Category()
                {
                    Name = "Топла и домашна",
                    ParentCategory = category1,
                };
                await dbContext.Categories.AddAsync(categories2);
                #endregion

                #region Services

                //Services
                string[] ownerNames = new string[50]
                {
                    "Димитър Василев",
                    "Кирил Иванов",
                    "Иван Иванов",
                    "Петър Петров",
                    "Георги Георгиев",
                    "Николай Николов",
                    "Васил Василев",
                    "Стефан Стефанов",
                    "Кирил Николов",
                    "Росен Василев",
                    "Виктор Стефанов",
                    "Владимир Николов",
                    "Станимир Василев",
                    "Христо Стефанов",
                    "Любомир Николов",
                    "Иван Василев",
                    "Радостин Георгиев",
                    "Искрен Николов",
                    "Мирослав Василев",
                    "Димитър Николов",
                    "Павлин Иванов",
                    "Марин Петров",
                    "Симеон Георгиев",
                    "Станимир Иванов",
                    "Веселин Петров",
                    "Яна Василева",
                    "Йордан Иванов",
                    "Костадин Петров",
                    "Петко Георгиев",
                    "Ангел Иванов",
                    "Добромир Петров",
                    "Кирил Василев",
                    "Емил Георгиев",
                    "Деян Иванов",
                    "Илия Петров",
                    "Светослав Василев",
                    "Георги Димитров",
                    "Спас Георгиев",
                    "Александър Петров",
                    "Борислав Иванов",
                    "Веселин Петров",
                    "Мариан Георгиев",
                    "Емануил Василев",
                    "Валентин Петров",
                    "Ивайло Иванов",
                    "Петър Стефанов",
                    "Георги Василев",
                    "Атанас Иванов",
                    "Веселин Георгиев",
                    "Петко Димитров"
                };

                string[] names = new string[50]
                {
                    "Почистване на килими",
                    "Почистване на прозорци",
                    "Почистване на апартаменти",
                    "Миене на коли",
                    "Поддръжка на градина",
                    "Гледане на деца",
                    "Гледане на кучета или котки",
                    "Направа на сайт и поддръжка",
                    "Поправка на покриви",
                    "Ремонт на коли",
                    "Монтаж и поддръжка на парални и сушилни",
                    "Изготвяне и доставка на букети",
                    "Рисуване на карикатури",
                    "Водопроводчик",
                    "Електротехник",
                    "Хамалски услуги",
                    "Езикови уроци",
                    "Поправка на телефони",
                    "Шивашки услуги",
                    "Фризьорски услуги",
                    "Масаж",
                    "Физио терапия",
                    "Частен йога учител",
                    "Финансови съвети ,счетоводство",
                    "Брокерски услуги",
                    "Личен асистент",
                    "Частен диетолог",
                    "Частен фитнес инструктор",
                    "Поддръжка на социални медии",
                    "Монтаж на мебели",
                    "Маникюр и педикюр",
                    "Частни уроци по учебни предмети",
                    "Фотографски услуги",
                    "Охрана",
                    "Адвокатски услуги",
                    "Личен шофьор",
                    "Гримьор",
                    "Кариерен съветник (career coach)",
                    "Уроци по танци",
                    "Уроци по китара",
                    "Психолог",
                    "Поправка на черна и бяла техника",
                    "Превод",
                    "Видео обработка и монтаж",
                    "Логопет",
                    "DJ",
                    "Аниматори за детско събитие",
                    "Курс по самоотбрана",
                    "Изработка на торти по поръчка",
                    "Боядисване"
                };

                string[] descriptions = new string[50]
                {
                    "Добре дошли в нашата услуга за почистване на килими! Ние се грижим за безупречната чистота и свежест на вашите килими с усмивка. С нашите професионални методи и оборудване, вашите килими ще бъдат безпогрешно чисти и красиви. Оставете нас да се погрижим за тях, като ви осигурим спокойствие и удовлетворение от резултата. Свържете се с нас днес и осигурете си чистота и уют в дома си!",
                    "Почистване на прозорци! Ние се грижим за ярката и чиста атмосфера във вашия дом или офис. С професионални методи и внимателно внимание към всеки детайл, ние осигуряваме кристална яснота и блестящо чисти прозорци. Оставете ни да направим светлината да проникне във вашия живот с яркост и свежест!",
                    "Пълно почистване на апартаменти! Ние сме тук, за да направим вашият дом просторен, уютен и безупречно чист. С нашето внимание към детайлите и професионално качество на работа, ще се погрижим за всеки ъгъл на вашия апартамент. Освободете се от стреса на почистването и се наслаждавайте на безгрижието във вашия свеж и приятен дом!",
                    "Ние предлагаме услуга за професионално миене на коли, която ще ви осигури блясък и чистота както отвън, така и отвътре. С висококачествени продукти и внимание към всеки детайл, ние ще ви осигурим перфектно почистена кола, която се радва на безупречен вид. Ние ще вземем колата от вашия адрес мръсна и ще ви я върнем на същия адрес като чисто нова. Предоставете ни възможността да преобразим вашата кола в оазис на чистота и комфорт.",
                    "Запазете вашата градина в безупречно състояние с нашата услуга за поддръжка! Ние се грижим за всеки елемент от вашата градина с любов и професионализъм. От косене на тревата и подрязване на храсти до поддържане на цветята и използване на висококачествени торове - ние сме тук, за да направим вашата градина да процъфтява. Доверете ни се да превърнем вашия външен спейс в истински рай за отдих и красота!",
                    "Прецизна грижа за вашите деца! Като опитен и отговорен човек, предлагам услуга за гледане на деца с любов и внимание. От игри в дома до разходки на открито и помощ с учебни задачи, аз съм тук, за да се погрижа за вашите малки съкровища, като им осигуря безопасна и забавна среда. Вие можете да се чувствате спокойни, като знаете, че вашите деца са в добри ръце.",
                    "Грижа и внимание за вашите любими домашни любимци! Като ентусиазиран пет ситър, предлагам услуга за гледане на кучета и котки с грижа и обич. От разходки в парка до игри в дома и хранене, аз съм тук, за да се грижа за вашите пухкави приятели, като им осигуря внимание и уют във вашия дом. Вие може да се отпуснете, като знаете, че вашите домашни любимци са в безопасни и любящи ръце.",
                    "Като опитен уеб дизайнер и разработчик, предлагам услуга за създаване на персонализиран уебсайт според вашите нужди и предпочитания. От началното проектиране до реализацията и последващата поддръжка, аз ще се грижа за всеки аспект на вашия уебсайт, така че той да остава актуален, функционален и привлекателен за вашите потребители. Вие можете да се фокусирате на своя бизнес, докато аз вземам грижа за онлайн присъствието ви.",
                    "Аз съм квалифициран специалист по покриви, предлагам услуга за професионално ремонтиране и поддръжка на вашия покрив. Независимо дали става въпрос за поправка на пукнати или изтекли места, замяна на бити тухли или регулиране на капаки, аз съм тук, за да ви осигуря качествени и надеждни решения за вашата къща или бизнес. Доверете се на моите умения и опит, за да ви предоставя професионално обслужване и спокойствие относно вашия покрив.",
                    "Ремонт и поддръжка на вашия автомобил - ето какво предлагам! С многогодишен опит като автомобилен механик, грижата за вашата кола е в добри ръце. Независимо дали става въпрос за малки поправки или сериозни ремонти, аз съм на ваше разположение за всякаква помощ. Без значение дали се нуждаете от замяна на части, изправяне на каросерията или диагностика на проблеми, ще се погрижа автомобилът ви да бъде във форма и отново на пътя. Вие можете да се чувствате спокойни, че вашият автомобил е в добри ръце.",
                    "Поддръжка и монтаж на перални и сушилни - предоставям тази услуга с грижа и професионализъм. Независимо дали ви трябва поправка на вашия сушилник или инсталиране на нова пералня, аз съм тук, за да ви помогна. Със специализиран опит и внимание към всеки детайл, гарантираме, че вашите уреди ще функционират безпроблемно. Оставете ми да се погрижа за перфектната работа на вашите перални и сушилни, за да ви осигуря спокоен и удобен ежедневен живот.",
                    "Изготвяне и доставка на букети - ние предлагаме тази услуга с любов и внимание към детайлите. Независимо от повод или събитие, ние сме тук, за да ви помогнем да изразите чувствата си с красиви цветя. Със специален акцент върху естетика и качество, всеки букет е уникален и внимателно изработен от нашият опитен екип. Оставете нас да се погрижим за изработката и доставката на вашия персонализиран букет, за да зарадвате вашия получател и да направите специалния ден още по-специален.",
                    "Изработка на карикатури по поръчка - предлагам тази услуга с любов към рисуването и внимание към детайлите. Независимо от повода - подарък за рожден ден, сватба или юбилей, моят артистичен талант е тук, за да ви помогне да зарадвате вашия получател с уникална и забавна карикатура. С моя професионализъм и внимателен подход, всеки портрет е персонализиран и внимателно изработен. Ще създам уникално произведение на изкуството, което ще запечати спомените и ще достави усмивки на лицата на всички.",
                    "Ремонт и инсталиране на водопроводи - предлагам тази услуга с професионализъм и надеждност. Независимо дали имате нужда от поправка на изтичане или инсталиране на нови тръби, моят опит и уменият са тук, за да ви помогнат. Със специализирани умения и внимание към всеки детайл, гарантирам бързо и качествено решение на вашите проблеми с водопроводите. Доверете се на мен, за да ви осигуря безопасно и надеждно водоснабдяване във вашия дом или бизнес.",
                    "Ремонт и инсталация на електрически мрежи - предлагам тази услуга с професионализъм и отговорност. Независимо дали имате нужда от поправка на електрически проблеми във вашата електрическа мрежа или инсталиране на нови компоненти, моите умения и опит са на ваше разположение. Със специализирани умения и внимание към всеки детайл, гарантирам качествено и надеждно решение на всяка електротехническа задача.",
                    "Пренасяне и преместване на битово и офис оборудване - предоставям тази услуга с грижа и професионализъм. Независимо от това дали имате нужда от помощ при местене на мебели, електроуреди или други тежки предмети, моите услуги като хамал са на разположение. Със специализирани умения и внимание към вашите вещи, гарантирам бързо и ефективно преместване на вашите вещи на време. Не сте сами в това преместване.",
                    "Специализиран съм в обучение на различни езици и съм на разположение да ви помогна да подобрите вашия говор, писане, разбиране и четене. Със структурирани уроци и индивидуален подход, гарантирам успешното ви усвояване на новия език.",
                    "При всякакви проблеми свързани с телефони и таблети като счупен екран, лоша батерия или бавно зареждане. Можете да ме потърсите моментално. Аз ще дойда до адреса ви, ще направя бърза инспекция на телефона ви и ще се уверя че работи перфектно до 2-4 дни.",
                    "Преправяне на булчински и бални рокли, но също и на панталони и блузи. Вече няма нужда да изхвърляте дрехите които са ви омаляли или прекалено големи. Петно или скъсано- мога да помогна и с това. Изпратете ми имейл с кратко описание на ситуацията, за да дойда подготвена в дома ви с всичко необходимо за поправката на платовете.",
                    "Със своя опит и креативност, аз работя внимателно с всеки клиент, за да осигуря удовлетворителни резултати, които отразяват вашата индивидуалност и стил. Вярвам в важността на доброто обслужване и личната връзка с клиентите си, затова винаги се стремя да създам уютна и приятна обстановка. Всички материали които използвам са с био произход и са напълно безопасни за хора с алегрии или непоносимост към бои. Нека заедно работим за постигане на вашия идеален външен вид и да направим всеки момент при нас специален и незабравим.",
                    "Разкрийте дълбоката релаксация и възстановяване с моите масажни услуги. Предлагам широка гама масажи- отпускащи, интензевни, арома терапия, болкоуспокояваши и раздвижващи. Не се колебайте да се свържете и да си запазите час възможно най-скоро.",
                    "С комбинация от различни техники и дълбоко разбиране за работата с мускулите и тъканите, аз създавам индивидуални програми за всяка отделна сесия. Моят цел е да ви осигуря релаксация, като същевременно помагам на вашето тяло да се възстанови и възобнови. С моята професорска степен и опит в различни държави (Германия, Австрия, Нидерландия, Словакия), съм готова да започна лечението на вашите болежки. Дори не е необходимо да напускате комфорта на вашия дом, аз ще дойда на място с всичко необходимо за сесията.",
                    "Персонализирани йога сесии - като частен йога учител, създавам индивидуални програми, които отговарят на вашите нужди и цели. Със своя опит и внимание към вашия уникален физически и емоционален статус, създаваме уроци, които са напълно насочени към вашето благополучие и развитие. Независимо дали искате да подобрите гъвкавостта си, да намалите стреса или да поддържате общото си здравословно състояние, аз съм тук, за да ви подкрепя и насърчавам.",
                    "Моят подход е ориентиран към вашия уникален ситуационен контекст и ви помага да разберете вашите възможности за инвестиране, осигуряване на пенсия, управление на дългове и други финансови въпроси. Със своя опит и професионализъм, аз ви предоставям ясни и разбираеми съвети, които ви помагат да вземете информирани решения за вашето бъдеще. Позволете ми да ви бъда партньор във вашия финансов път и да ви помогна да постигнете финансовата стабилност и благополучие, което желаете.",
                    "С активно изследване на пазара и внимателен анализ на вашите предпочитания и цели, аз ви предоставям обективни съвети през целия процес на покупка или продажба на имот. Независимо дали търсите дом за семейството си, инвестиционен обект или комерсиално пространство, моят ангажимент е да ви помогна да намерите най-доброто решение за вас.",
                    "Вече не успявате да се справите с всичките ви задачи, имейли, запазване на срещи и т.н. Ежедневието ви е напрегнато и живеете в притеснение, че винаги забравяте нещо- мисля че мога да ви помогна да сложите живота си в правилния ред с моите невероятни способности по планиране и управление на задачи. Всеки от клиентите ви ще получи отговор на време, а вие никога няма да пропускате среща дори в личния ви живот.",
                    "Заедно ще разглеждаме вашите текущи хранителни навици, здравословни проблеми и фитнес цели, за да разберем какви промени могат да бъдат направени за постигане на желаните резултати. Независимо дали търсите да отслабнете, да подобрите енергийно ниво или да поддържате определена хранителна режима.",
                    "Искате ли да влезете във форма бързо и без да губите времето учейки цялата теория зад всяко упражнение. Можете да се възползвате от моите знания в залата и да ви помогна с персонализирана програма според вашата текуща форма и желания резултат.",
                    "Като вашият социален медийен мениджър, аз предлагам индивидуални решения и стратегии за управление на вашите социални медии. Със своя професионален опит и креативност в областта на дигиталния маркетинг, работя с вас, за да създадем персонализиран план за присъствие в социалните медии, който отговаря на вашите цели и нужди. Чрез анализ на вашата целева аудитория, конкурентите във вашата ниша и вашите собствени маркетингови цели, аз разработвам стратегия за съдържание и публикации, които ще ангажират вашата аудитория и увеличат видимостта на вашата марка в социалните медии.",
                    "Ако имате нужда от помощ със сглобяването на мебели поради ред причини, например не ви достига младост, сила или просто не ви бива в тези неща. Не се колебайте да се свържете с мен, имам опит в сглобяването на кухни, гардероби и спални.",
                    "Чрез внимателно избрани продукти и внимание към детайлите, гарантирам, че вашите нокти са оформени перфектно и изглеждат невероятно. Независимо дали търсите класически, елегантен маникюр или креативен и модерен дизайн, аз мога да ви го осигуря във вашия дом за максимум един час. Ако все още нямате вдъхновение, не се притеснявайте аз ще ви предложа много и различни дизайни с декорации и изграждане. Това важи и за педикюри.",
                    "И вашето дете ли се затруднява със задачите по математика, български и биология? Всеки родител би опитал да помогне на своя ученик, но понякога това е мислията невъзможна...материала е просто някак прекалено труден за обяснение. На помощ идвам аз, професионалист по учебния материал от 1-10 клас.",
                    "Искате ли вашите моменти ще бъдат заснети с внимание към детайлите и емоциите. Независимо дали става въпрос за сватба, портретна сесия, семейно събитие или корпоративен ивент, аз съм тук, за да запечатам най-добрите моменти от вашето събитие. Фотосесии с различни декори на закрито, но не само. Запазете си час възможно най-скоро за да обсъдим най-новите трендове във фотографията.",
                    "Чрез използване на най-съвременните технологии за сигурност и разработване на индивидуална стратегия за предотвратяване на рискове, гарантирам високо ниво на безопасност и защита за вас и вашите имущества. Мога да ви следвам където пожелаете или мога да наблюдавам дома ви онлайн. Избора е ваш.",
                    "Персонализирани адвокатски услуги, насочени към вашите нужди. Осигурявам ясни и обективни съвети, за да ви помогна да решите вашите правни проблеми. Моят подход е да бъда ваш партньор през целия процес, осигурявайки ви професионално и етично обслужване при бракоразводни дела, бизнес дела, подялба на имоти, измами и други.",
                    "Чрез висок стандарт на професионализъм и дискретност, гарантирам вашето удобство и поверителност по време на пътуване. Независимо дали става въпрос за лични или служебни ангажименти, моят цел е да ви предоставям удобство и спокойствие по време на вашите пътувания. Няма кой да закара децата на училище, няма проблем, аз мога да направя това! Часа няма значение, аз ще бъда на разположение за вас.",
                    "Предлагам персонализиран грим, който подчертава вашата натурална красота и излъчва стил и увереност. Правя грим подходящ за ежедневието, балове, сватби, рожденни дни, годишини, но също и подготовка за фотосесии. Ако не сте убедени в моите способности винаги можем да направим пробен грим преди събитието.",
                    "Открийте своя професионален път с помощта на кариерния съветник! Като вашият личен кариерен наставник, аз ще ви помогна да изградите ясно разбиране за вашите професионални цели, да идентифицирате вашите силни страни и интереси, както и да определите най-подходящите за вас кариерни възможности. Заедно ще подготвим вашата автобиография и мотивационно писмо, както и ще се подготвим за интервю, за да се уверим че винаги ще давате правилния отговор на коварните въпроси на отдел човешки ресуси.",
                    "Заплетете се в ритъма с уроците по танци! Като вашият танцов инструктор, ще ви покажа как да изразите своята страст към движението и музиката чрез танц. С моя опит и индивидуален подход, ще ви науча на основите на различни стилове - от салса и ча-ча-ча до хип-хоп и съвременен танц.",
                    "Предлагам индивидуални уроци по китара, които ще ви въведат в магията на музиката. С моята страст към инструмента и преподавателски опит, аз ще ви насоча в света на акордите, скалите и ритъма, като ви помогна да развиете техниката си и да откриете вашия уникален стил. Ще ви предоставя индивидуални уроци, които ще ви насърчават да изразите себе си чрез музиката и да се наслаждавате на процеса на учене. На разположение в дома ви.",
                    "Имате ли лоши сънища или наприятни преживявания напоследък, чувствате ли се тревожни и тъжни на моменти? Ако можете да се разпозаете в някои от тези симптоми, то тогава ви моля да се обърнете към мен, вашия професионален психолог, които е винаги отворен да ви изслуша и помогне да достигнете до корена на проблема и да го разрешите. Винаги сте добре дошли в кабинета ми, но също така правя визитации по домовете, както и срещи онлайн. От колко сесии имате нужда точно ще определим през първата ни среща.",
                    "Предлагам професионални услуги за диагностика, ремонт и поддръжка на различни уреди, включително перални машини, съдомиялни машини, хладилници, фризери, котлони, фурни и други. Всеки уред който може да бъде спасен от изхвърляне, ще бъде поправен за по-малко пари от закупуването на нов.",
                    "Като вашият сътрудник в областта на езиковите услуги, предоставям професионални преводачески услуги за превод на текстове от един език на друг. Със своята езикова компетентност и културна чувствителност, аз осигурявам точен и качествен превод на вашите документи, съобщения или материали. Срещу допълнително заплащане мога да ви придружа на бизнес срещи или конференции в България и в чужбина.",
                    "С използване на монтаж, корекция на цветовете и добавяне на специални ефекти, създавам видеоклипове, които впечатляват зрителите и предават вашето послание с яснота и емоция. Имам опит в лични събития, бизнес презентации или рекламни клипове, целта ми е да предоставям качествени и професионални видеопродукции.",
                    "Със специализация в речевото развитие, предлагам индивидуални уроци и терапия за подобряване на комуникационните умения на децата. Моят подход включва търпеливо внимание към нуждите на всяко дете и използване на ефективни техники за развитие на речта и самочувствие в общуването. Ако вашето дете е в детска градина и изпитва затруднения с изговарянето на определени думи, не се колебайте да се свържете с мен. Провеждам срещите в дома или в кабинета ми.",
                    "Моят професионален подход включва не само предоставяне на качествена музика, но и умело възпроизвеждане на настроението на вашето събитие. Позволете ми да направя вашата вечер незабравима и пълна с музикални емоции и танци. Успешно боравя с всички жанрове музика и умея да ги миксирам според настроението на гостите. В повечето случаи смяната ми продължава 5 часа, но можем да се уговорим и за повече ако партито трябва да продължи по-дълго.",
                    "Нашите аниматори са опитни и креативни, готови да създадат вълшебна атмосфера и да развеселят децата с множество забавни игри, лица за боядисване, възможности за творчество и интерактивни представления. Със забавни и разнообразни активности, ние създаваме уникално и незабравимо изживяване за децата и техните родители.",
                    "Персонализиран курс по самоотбрана - като вашият инструктор по самозащита, аз предоставям индивидуални уроци и обучение за увереност и безопасност в различни ситуации. Със своя опит и експертиза в областта на бойните изкуства и самозащита, аз ви уча на техники и стратегии за предпазване на себе си и вашите близки в защитена среда, които може да използвате на улицата при нужда.",
                    "Моят подход е да бъда внимателна към вашите желания и изисквания, като същевременно внимавам да създам торта, която отразява вашата индивидуалност и стил. Защото вида не е всичко, аз използвам най-добрите продукти на пазара за изработката на тортите и ги пека в деня на събитието, за да гарантирам че са винаги пресни.",
                    "Ако имате една или няколко стаи за боядисване и бихте искали всяка капка боя да попадне на правилното място на стената, моля свържете се."
                };

                int[] mainImgIds = new int[50]
                {
                    6195122,
                    18266080,
                    3768910,
                    4870664,
                    2013782,
                    296301,
                    2215599,
                    196655,
                    1453799,
                    2244746,
                    5591460,
                    1179026,
                    4649254,
                    8486923,
                    5691589,
                    4246202,
                    5905923,
                    1388947,
                    1266139,
                    3738339,
                    3757942,
                    275768,
                    1375883,
                    265087,
                    8469937,
                    4427430,
                    15319047,
                    1552242,
                    533446,
                    5805487,
                    791157,
                    714698,
                    320617,
                    18275559,
                    6077326,
                    1135379,
                    3089849,
                    4344878,
                    2188012,
                    1407322,
                    4101143,
                    3822850,
                    5238126,
                    1117132,
                    5896577,
                    844928,
                    7180617,
                    7045483,
                    461431,
                    994164
                };

                int[] imgSet1 = new int[50]
                {
                    3965509,
                    4239091,
                    4239031,
                    4218867,
                    1023402,
                    1449934,
                    7055937,
                    574071,
                    209235,
                    279949,
                    4993073,
                    5409707,
                    380709,
                    4194858,
                    163100,
                    2652945,
                    5428002,
                    196653,
                    5467466,
                    3356170,
                    7598366,
                    5794059,
                    3094230,
                    210574,
                    8292826,
                    357514,
                    15319038,
                    414029,
                    243925,
                    4554425,
                    3997379,
                    4145153,
                    1391786,
                    1119152,
                    5668772,
                    3160544,
                    8558242,
                    5439453,
                    358010,
                    1656066,
                    5699466,
                    16385070,
                    5217882,
                    927444,
                    3769981,
                    625644,
                    3071456,
                    6253310,
                    2531546,
                    3990359,
                };

                int[] imgSet2 = new int[50]
                {
                    38325,
                    713297,
                    4099467,
                    3775124,
                    2433500,
                    1001914,
                    1870301,
                    546819,
                    3771111,
                    3822843,
                    8774424,
                    1058771,
                    17959072,
                    7859953,
                    4792521,
                    4247770,
                    159581,
                    1476321,
                    3738088,
                    3993449,
                    3757952,
                    5794024,
                    3823039,
                    210607,
                    8470803,
                    4308096,
                    15319043,
                    2247179,
                    927629,
                    4554426,
                    3422099,
                    3184317,
                    442573,
                    207574,
                    618158,
                    7433,
                    4911192,
                    5989933,
                    209948,
                    625788,
                    4101164,
                    1476318,
                    6281880,
                    1051544,
                    5905703,
                    417458,
                    7099947,
                    8612011,
                    1702373,
                    221027,
                };

                var urlStart = "https://images.pexels.com/photos/";
                var urlBetween = "/pexels-photo-";
                var urlEnd = "?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1";
                var extension = ".jpeg";

                var services = new List<SkillBoxService>();
                for (int i = 0; i < 50; i++)
                {
                    var service = new SkillBoxService()
                    {
                        Name = names[i],
                        Description = descriptions[i],
                        Category = categories2, //TODO more categories
                        MainImage = $"{urlStart}{mainImgIds[i]}{urlBetween}{mainImgIds[i]}{extension}{urlEnd}",
                        Images = $"{urlStart}{imgSet1[i]}{urlBetween}{imgSet1[i]}{extension}{urlEnd}|" +
                        $"{urlStart}{imgSet2[i]}{urlBetween}{imgSet2[i]}{extension}{urlEnd}|",
                        Price = 0m, //TODO column PriceInfo
                        Discount = 0m,
                        Owner = user1,
                        OwnerName = ownerNames[i], //Too many users as skillers
                        PhoneNumber = phoneNumbers[i],
                        City = cities[i],
                        ServiceStatus = (ServiceStatus)rnd.Next(0, 3)
                    };
                    services.Add(service);
                    await dbContext.Services.AddAsync(service);
                }

                //var imgId = "6195122";
                //var service1 = new SkillBoxService()
                //{
                //    Name = "Почистване на килими",
                //    Description = "Добре дошли в нашата услуга за почистване на килими! Ние се грижим за безупречната чистота и свежест на вашите килими с усмивка. С нашите професионални методи и оборудване, вашите килими ще бъдат безпогрешно чисти и красиви. Оставете нас да се погрижим за тях, като ви осигурим спокойствие и удовлетворение от резултата. Свържете се с нас днес и осигурете си чистота и уют в дома си!",
                //    Category = categories2,
                //    MainImage = $"{urlStart}{imgId}{urlBetween}{imgId}{extension}{urlEnd}",
                //    Images = $"{urlStart}3965509{urlBetween}3965509{extension}{urlEnd}|{urlStart}38325/vacuum-cleaner-carpet-cleaner-housework-housekeeping-38325.jpeg{urlEnd}",
                //    Price = 20.50m,
                //    Discount = 0m,
                //    Owner = user1,
                //    OwnerName = $"{user1.FirstName} {user1.LastName}",
                //    PhoneNumber = "359871234567",
                //    City = City.Shumen,
                //    ServiceStatus = ServiceStatus.Active
                //};
                //await dbContext.Services.AddAsync(service1);
                #endregion

                #region ServiceUsers
                
                ////ServiceUsers
                //ServiceUser[] serviceUsers = new ServiceUser[50];
                //for (int i = 0; i < serviceUsers.Count(); i++)
                //{
                //    var serviceUser = new ServiceUser
                //    {
                //        Service = services[0],
                //        User = user1,
                //    };
                //    await dbContext.ServiceUsers.AddAsync(serviceUser);
                //}
                #endregion

                #region Chats
                //Chats
                var chat1 = new Chat()
                {
                    Name = $"{user1.FirstName}, {user2.FirstName}",
                    Service = services[0]
                };
                await dbContext.Chats.AddAsync(chat1);

                var chat2 = new Chat()
                {
                    Name = $"{user1.FirstName}, {user2.FirstName}",
                    Service = services[0]
                };
                await dbContext.Chats.AddAsync(chat2);

                var chat3 = new Chat()
                {
                    Name = $"{user1.FirstName}, {user2.FirstName}",
                    Service = services[0]
                };
                await dbContext.Chats.AddAsync(chat3);

                //UserMessages
                var userMessage1 = new UserMessage()
                {
                    Owner = user1,
                    Chat = chat1,
                    Content = "Пиша в новосъздадения чат!"
                };
                await dbContext.UserMessages.AddAsync(userMessage1);

                var userMessage2 = new UserMessage()
                {
                    Owner = user2,
                    Chat = chat1,
                    Content = "Аз ти отговарям!"
                };
                await dbContext.UserMessages.AddAsync(userMessage2);

                var userMessage3 = new UserMessage()
                {
                    Owner = user1,
                    Chat = chat2,
                    Content = "Пиша в новосъздадения чат!"
                };
                await dbContext.UserMessages.AddAsync(userMessage3);

                var userMessage4 = new UserMessage()
                {
                    Owner = user2,
                    Chat = chat2,
                    Content = "Аз ти отговарям!"
                };
                await dbContext.UserMessages.AddAsync(userMessage4);

                var userMessage5 = new UserMessage()
                {
                    Owner = user1,
                    Chat = chat3,
                    Content = "Пиша в новосъздадения чат!"
                };
                await dbContext.UserMessages.AddAsync(userMessage5);

                var userMessage6 = new UserMessage()
                {
                    Owner = user2,
                    Chat = chat3,
                    Content = "Аз ти отговарям!"
                };
                await dbContext.UserMessages.AddAsync(userMessage6);

                //ChatUsers - [Chats - Participants]
                var chatUser1 = new ChatUser
                {
                    Chat = chat1,
                    User = user1, //Participant
                };
                await dbContext.ChatUsers.AddAsync(chatUser1);

                var chatUser2 = new ChatUser
                {
                    Chat = chat1,
                    User = user2, //Participant2
                };
                await dbContext.ChatUsers.AddAsync(chatUser2);

                var chatUser3 = new ChatUser
                {
                    Chat = chat2,
                    User = user1, //Participant
                };
                await dbContext.ChatUsers.AddAsync(chatUser3);

                var chatUser4 = new ChatUser
                {
                    Chat = chat2,
                    User = user2, //Participant2
                };
                await dbContext.ChatUsers.AddAsync(chatUser4);

                var chatUser5 = new ChatUser
                {
                    Chat = chat3,
                    User = user1, //Participant
                };
                await dbContext.ChatUsers.AddAsync(chatUser5);

                var chatUser6 = new ChatUser
                {
                    Chat = chat3,
                    User = user2, //Participant2
                };
                await dbContext.ChatUsers.AddAsync(chatUser6);
                #endregion

                await dbContext.SaveChangesAsync();
            }
        }
    }
}